app/views/posts/show.html.erb


<% @post.edits.each do |edit| %>
  <li><%= link_to(edit.editer_name, "/users/#{@user.id}") %>
  <%= edit.created_at.strftime('%Y/%m/%d') %>
---
SELECT "edits".* FROM "edits" WHERE "edits"."post_id" = ?  [["post_id", 2]]
INSERT INTO "edits" ("editer_name", "created_at", "updated_at", "post_id", "edit_text") VALUES (?, ?, ?, ?, ?)  [["editer_name", nil], ["created_at", "2022-08-14 09:54:56.344537"], ["updated_at", "2022-08-14 09:54:56.344537"], ["post_id", nil], ["edit_text", "あああ"]]