app/controllers/edits_controller.rb

  def create
    @edit = Edit.new(
      edit_text: params[:edit_text],
      editer_name: @current_user.name,
      editer_id:  @current_user.id,
      post_id: params[:post_id]
    )
    @edit.save
---
INSERT INTO "edits" ("editer_name", "created_at", "updated_at", "post_id", "edit_text", "editer_id") VALUES (?, ?, ?, ?, ?, ?)  [["editer_name", "ito"], ["created_at", "2022-08-14 17:53:37.068441"], ["updated_at", "2022-08-14 17:53:37.068441"], ["post_id", 1], ["edit_text", "pupupup"], ["editer_id", 5]]

  def show
    @edits = Edit.all
    @edit = Edit.find_by(id: params[:id])
---
SELECT "edits".* FROM "edits" WHERE "edits"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]