app/controllers/maps_controller.rb

  def show
    @map_name = params[:map_name]
    @map = Map.find_by(id: params[:id])
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]