app/controllers/posts_controller.rb

  def new
    @maps = Map.all
---
SELECT "maps".* FROM "maps"

  def create
    @maps = Map.all
    @post = Post.new(
      post_name: params[:post_name],
      mini_content: params[:mini_content],
      content: params[:content],
      map_id: params[:map_id],
      user_id: @current_user.id,
      post_image:"no_post_image.png"
    )

    if params[:image]
      @post.post_image = "#{@post.id}.jpg"
      image = params[:image]
      File.binwrite("public/post_images/#{@post.post_image}",image.read)
    end

    if @post.save
---
SELECT "maps".* FROM "maps"
INSERT INTO "posts" ("post_name", "mini_content", "content", "user_id", "map_id", "created_at", "updated_at", "post_image", "string", "editer_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
    @posts = Post.where(map_id: params[:map_name])
---
SELECT "posts".* FROM "posts" WHERE "posts"."map_id" IN (SELECT "maps"."id" FROM "maps" WHERE "maps"."map_name" = ?)  [["map_name", "蝦夷(北海道)"]]

  def show
    @posts = Post.all
    @edits = Edit.all
    @post = Post.find_by(id: params[:id])
    @user = User.find_by(id: @post.user_id)
---
SELECT "posts".* FROM "posts"
SELECT "edits".* FROM "edits" WHERE "edits"."post_id" = ?  [["post_id", 2]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def edit
    @maps = Map.all
    @post = Post.find_by(id: params[:id])
---
SELECT "maps".* FROM "maps"
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @maps = Map.all
    @post = Post.find_by(id: params[:id])
    @post.mini_content = params[:mini_content]
    @post.content = params[:content]
    @post.map_id = params[:map_id]

    if params[:image]
      @post.post_image = "#{@post.id}.jpg"
      image = params[:image]
      File.binwrite("public/post_images/#{@post.post_image}",image.read)
    end

    if @post.save
---
SELECT "maps".* FROM "maps"
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ?, "editer_name" = ? WHERE "posts"."id" = ?  [["content", "ヒグマを５０頭"], ["updated_at", "2022-08-11 12:04:55.574023"], ["editer_name", "mama"], ["id", 1]]