app/controllers/users_controller.rb

  def show
    @posts = Post.all
    @user = User.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name:"no_user_image.jpg",
      password: params[:password]
      )
      if params[:image]
        @user.image_name = "#{@user.id}.jpg"
        image = params[:image]
        File.binwrite("public/user_images/#{@user.image_name}",image.read)
      end
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}",image.read)
    end

    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "image_name" = ? WHERE "users"."id" = ?  [["updated_at", "2022-08-10 10:19:16.179307"], ["image_name", "1.jpg"], ["id", 1]]

  def login
    @user = User.find_by(email: params[:email],
                         password: params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "shinnosuke@gmail.com"], ["password", "[FILTERED]"], ["LIMIT", 1]]